said
mln
dlrs
pct
vs
year
billion
company
u
would
cts
bank
inc
new
net
corp
last
one
market
stock
also
loss
shares
two
share
trade
co
shr
government
may
oil
sales
first
april
debt
exchange
march
profit
three
per
price
prices
group
banks
interest
told
foreign
dlr
international
week
rate
ltd
japan
agreement
could
quarter
tonnes
securities
today
five
tax
president
expected
dollar
february
month
revs
due
total
years
january
common
offer
added
financial
economic
world
production
board
rates
trading
rose
japanese
end
increase
meeting
current
officials
made
spokesman
capital
six
earlier
four
industry
record
issue
system
major
months
time
business
companies
american
sources
investment
federal
next
note
official
growth
chairman
finance
markets
countries
general
commission
yen
credit
rise
nine
national
statement
state
since
united
minister
unit
cash
west
analysts
stg
exports
department
term
states
pay
report
agreed
earnings
loan
june
plan
products
period
yesterday
central
budget
fell
sale
long
operations
set
money
cut
program
based
december
compared
public
export
lower
ec
day
currency
high
reported
offering
take
higher
announced
management
domestic
loans
plans
deficit
development
non
bond
around
buy
contract
talks
ago
shareholders
union
house
however
york
annual
policy
subsidiary
seven
economy
make
european
committee
lead
canada
assets
ministry
p
including
dealers
part
oper
country
terms
reagan
owned
demand
ended
outstanding
gas
brazil
proposed
futures
avg
firm
imports
investors
treasury
shrs
still
prior
recent
used
commercial
early
sold
reuters
bonds
income
sell
wheat
well
canadian
includes
service
increased
second
south
likely
value
july
basis
banking
eight
continue
average
level
private
operating
fiscal
available
third
acquisition
days
dividend
expects
fall
industrial
held
half
marks
funds
payments
traders
chief
services
previously
support
another
agriculture
fund
systems
senior
much
k
full
use
news
mths
figures
executive
called
gain
date
notes
firms
surplus
reserves
cost
estimated
amount
purchase
short
manager
agency
london
help
already
plant
previous
close
say
stocks
china
many
supply
results
approved
association
september
open
action
court
energy
industries
gold
bill
stake
preferred
administration
reserve
several
move
selling
costs
tender
british
farm
result
francs
include
issued
noted
asked
must
proposal
future
monetary
plc
bid
secretary
output
following
point
sector
payment
low
decision
sugar
possible
nil
div
merger
declined
less
levels
washington
line
reduce
bankers
conference
strong
german
approval
received
decline
largest
deal
prime
issues
financing
convertible
number
soviet
computer
offered
baker
change
losses
members
nations
joint
power
profits
within
might
germany
b
crude
debentures
currently
back
additional
later
index
product
inflation
late
large
effective
savings
according
far
points
n
units
way
tokyo
vice
completed
signed
work
local
control
revenues
community
grain
provide
gulf
paper
filed
whether
producers
insurance
equity
coffee
texas
making
data
western
weeks
qtr
start
although
priced
worth
trust
bought
problems
petroleum
order
comment
forecast
put
congress
reporters
standard
workers
meet
past
opec
position
paid
corn
planned
french
acquire
account
october
drop
spending
least
goods
options
measures
member
office
paris
certain
give
reached
range
friday
cents
without
f
negotiations
division
raised
acquired
analyst
even
need
plus
good
de
special
accord
l
equipment
final
subordinated
contracts
led
north
subject
people
among
real
despite
qtly
marketing
coupon
balance
see
think
fed
proceeds
saying
details
director
remain
officer
closed
fourth
show
party
continued
option
conditions
crop
raise
buying
given
europe
corporate
reduced
holding
venture
pacific
initial
area
near
recently
consumer
iran
effect
britain
split
scheduled
rights
resources
food
pressure
technology
import
base
ministers
go
america
facility
orders
target
package
bpd
senate
expect
small
holdings
c
france
bills
gains
research
changes
air
intervention
farmers
mark
security
come
november
council
volume
adjusted
little
lending
present
taken
main
working
yield
economists
addition
information
name
series
barrels
free
right
going
allow
proposals
get
showed
transaction
home
daily
tomorrow
swiss
receive
become
press
august
political
hold
morning
bundesbank
pact
latest
quoted
areas
manufacturing
commodity
yet
force
monday
payable
former
adding
letter
return
revised
law
soon
revenue
fixed
life
began
strike
named
poor
barrel
taiwan
electric
takeover
project
usda
moody
like
existing
steel
needed
leading
james
city
deposits
texaco
case
review
key
white
seeking
tonne
probably
begin
telephone
unchanged
head
rising
capacity
decided
taking
impact
chicago
gave
east
australian
warrants
traded
situation
cuts
partners
tariffs
directors
included
natural
creditors
reduction
agricultural
construction
us
restructuring
response
better
limited
problem
policies
car
holders
place
turnover
sterling
commerce
repurchase
heavy
increases
reform
cars
agreements
currencies
ag
underwriting
top
class
immediately
drug
extraordinary
ending
sharp
morgan
australia
related
want
charge
believe
issuing
combined
able
overseas
par
saudi
mainly
stores
study
exploration
operation
aid
chemical
slightly
seek
potential
call
growing
soybean
purchases
england
ahead
similar
principal
significant
dollars
discount
dutch
filing
form
sec
involved
southern
mexico
distribution
motors
hit
e
shareholder
rules
figure
brothers
kong
legislation
times
john
ruling
quota
reports
continuing
act
customers
boost
rather
almost
chrysler
certificates
merrill
institutions
efforts
excludes
personal
imf
performance
mortgage
mid
land
seen
developing
listed
delivery
respectively
investor
cocoa
africa
light
nakasone
brokers
taxes
increasing
difficult
cover
concern
war
network
consider
investments
lynch
sharply
corporation
overall
airlines
settlement
enough
communications
partnership
announcement
gross
liquidity
produce
produced
brazilian
producer
hong
discontinued
quotas
j
expansion
raising
lines
disclosed
caused
mining
transactions
remaining
pre
deposit
parent
employees
businesses
took
g
process
crisis
paying
institute
volcker
shearson
mine
franc
credits
improved
greater
robert
risk
vote
interests
keep
introduced
session
estimates
opposition
retail
night
nearly
request
extended
closing
limit
important
italy
statistics
northern
medium
projects
shipments
required
majority
korea
substantial
television
regulatory
post
interview
beginning
longer
aimed
stability
season
motor
iranian
necessary
test
nation
staff
offers
accounts
competition
telecommunications
run
declared
building
ibm
indicated
improve
affected
discuss
view
started
reach
indonesia
changed
failed
aircraft
provided
miles
charges
opening
competitive
source
newspaper
software
tons
defense
producing
designed
bring
tuesday
opened
military
came
hard
minimum
provision
remains
health
gatt
activities
computers
weather
buffer
dome
cent
expand
gm
activity
clear
street
estimate
managers
unless
lost
consumers
formed
dropped
prepared
california
st
left
needs
maintain
falling
allowed
quarterly
calls
parliament
means
copper
labour
question
field
underwriters
stop
borrowing
hours
outside
cooperation
best
flow
others
rejected
programs
requirements
cannot
salomon
particularly
fully
met
leaders
acquisitions
reflect
progress
ecuador
pipeline
face
argentina
considering
role
luxembourg
th
provisions
