the
of
to
in
and
a
said
mln
s
for
dlrs
vs
it
pct
on
is
from
that
at
by
its
be
will
year
with
cts
was
billion
he
u
an
has
as
would
net
company
not
bank
which
but
this
loss
are
have
were
last
shr
one
or
inc
had
new
market
they
trade
corp
share
about
oil
also
two
stock
shares
up
profit
april
may
been
tonnes
after
per
prices
debt
march
co
government
more
first
sales
price
revs
rate
than
interest
over
other
dollar
group
exchange
three
we
week
banks
dlr
foreign
japan
if
ltd
quarter
some
agreement
international
no
february
their
today
could
told
against
offer
january
due
there
five
expected
under
month
total
rates
all
securities
note
production
world
tax
rose
current
added
six
end
because
years
increase
between
into
meeting
issue
economic
nine
stg
record
common
months
japanese
growth
sources
while
rise
earlier
exports
when
yen
official
board
countries
made
credit
officials
cash
four
any
industry
spokesman
major
now
president
only
export
capital
financial
investment
through
trading
finance
time
west
central
earnings
oper
agreed
markets
should
yesterday
pay
further
next
department
avg
term
business
down
loan
shrs
american
december
analysts
sale
since
money
companies
out
report
lower
states
currency
commission
statement
fell
united
around
national
wheat
compared
higher
period
operations
imports
cut
minister
june
federal
before
dealers
ec
day
bond
products
high
general
i
unit
domestic
brazil
buy
gas
includes
non
his
long
such
mths
loans
take
set
lead
state
p
demand
reported
deficit
based
terms
management
seven
shareholders
however
policy
announced
chairman
both
can
prior
talks
during
acquisition
ended
plan
who
outstanding
each
bonds
most
did
treasury
european
program
system
traders
annual
same
assets
ago
country
average
economy
reserves
recent
basis
still
dividend
gain
part
surplus
level
south
tender
so
development
subsidiary
figures
ministry
being
nil
well
sugar
commercial
likely
plans
make
owned
early
york
increased
t
half
agriculture
marks
including
fall
sell
canada
canadian
payments
notes
sold
union
eight
gold
public
proposed
offering
stake
industrial
value
estimated
days
crude
income
manager
firm
investors
merger
short
continue
these
k
reuters
futures
private
committee
output
held
previously
supply
expects
our
previous
grain
results
coffee
bid
off
much
second
full
third
energy
fiscal
qtr
budget
amount
reserve
div
funds
francs
another
operating
september
until
producers
monetary
do
purchase
corn
help
very
levels
selling
issued
already
payment
opec
available
house
london
july
support
noted
debentures
close
nations
point
used
plc
stocks
senior
what
here
proposal
cost
deal
result
convertible
service
costs
bought
include
date
move
below
banking
following
low
gulf
m
decline
bankers
less
bill
them
petroleum
action
industries
say
cents
asked
sector
offered
german
secretary
forecast
china
washington
acquire
agency
those
farm
inflation
crop
change
strong
open
fund
reagan
reduce
baker
might
british
news
use
priced
bpd
possible
coupon
many
financing
approved
future
germany
points
largest
declined
association
fed
contract
preferred
called
paris
soviet
profits
acquired
intervention
above
several
barrels
late
must
completed
accord
raised
paper
issues
services
community
back
conference
large
losses
administration
within
far
bills
split
approval
goods
although
import
effective
n
drop
account
currently
buying
according
adjusted
firms
additional
line
b
good
decision
put
later
qtly
making
number
french
balance
subject
revenues
friday
standard
past
weeks
yield
paid
october
fourth
does
subordinated
way
equity
gains
barrel
trust
prime
product
need
control
negotiations
de
whether
usda
least
final
own
consumer
tonne
just
comment
worth
members
analyst
western
given
reached
see
executive
savings
index
give
l
show
received
continued
plant
even
real
measures
meet
despite
mark
led
plus
certain
position
start
target
data
remain
among
transaction
base
bundesbank
council
texas
signed
payable
conditions
joint
reporters
economists
without
saying
revised
lending
unchanged
expect
range
reduced
pact
pressure
planned
problems
tokyo
soybean
systems
special
units
chief
details
holding
closed
little
takeover
area
provide
then
farmers
taiwan
raise
local
effect
ministers
sterling
work
think
free
holdings
fixed
resources
near
court
natural
tomorrow
pacific
north
currencies
france
morning
marketing
australian
quota
how
rising
facility
come
present
cocoa
insurance
excludes
main
extraordinary
latest
november
showed
recently
few
where
areas
congress
proceeds
exploration
quoted
swiss
steel
name
deposits
daily
f
issuing
filed
c
taken
option
small
quotas
restructuring
america
package
rights
europe
member
food
britain
august
too
contracts
commodity
division
discontinued
get
office
letter
combined
iran
hold
england
changes
saudi
key
better
discount
tariffs
soon
volume
slightly
partners
order
power
moody
leading
morgan
agreements
dollars
australia
impact
go
purchases
charge
receive
monday
commerce
par
producer
scheduled
right
probably
addition
director
poor
holders
mexico
underwriting
adding
respectively
situation
return
taking
allow
initial
east
proposals
equipment
sharp
response
like
capacity
workers
buffer
spending
began
going
turnover
us
needed
included
season
growing
corporate
gave
re
seeking
agricultural
vice
yet
security
reduction
brazilian
mine
life
credits
investor
again
become
heavy
james
ending
chemical
mainly
principal
statistics
delivery
want
figure
gross
dutch
filing
d
traded
people
certificates
paying
problem
repurchase
press
warrants
creditors
don
africa
decided
review
city
head
home
place
policies
stability
indonesia
silver
hit
estimates
ahead
copper
working
venture
computer
pre
merrill
tons
increases
potential
believe
limited
sharply
increasing
top
project
light
boost
franc
political
force
manufacturing
strike
mortgage
you
produced
distribution
seen
case
raising
shipments
pipeline
significant
form
seek
mining
shipment
disclosed
options
ecuador
denominations
imf
shareholder
remaining
lynch
continuing
cent
korea
producing
weather
able
existing
chicago
research
estimate
call
operation
study
institute
ag
information
war
concern
immediately
directors
revenue
exporters
listed
g
southern
nearly
liquidity
almost
dome
usair
keep
cuts
efforts
rather
offers
similar
delegates
beef
technology
indicated
declared
argentina
series
related
parent
overseas
consider
mid
enough
shipping
brothers
act
interests
provision
consumers
overall
stores
gatt
venezuela
closing
difficult
she
rice
investments
changed
class
businesses
substantial
reflect
field
limit
senate
rules
luxembourg
corporation
session
port
minimum
consumption
undisclosed
shearson
seasonally
deposit
opened
falling
improved
steady
acquisitions
pretax
longer
supplies
improve
eurobond
e
philippines
unless
feet
aid
greater
construction
announcement
performance
italy
kong
o
ct
involved
st
iranian
gencorp
discuss
guaranteed
reports
provided
caused
diluted
maintain
risk
night
produce
view
beginning
interview
totalled
legislation
competitive
medium
quarterly
land
retail
party
cotton
soybeans
spot
