the
of
to
and
said
in
a
s
for
mln
it
dlrs
on
pct
is
that
from
its
by
will
vs
be
at
with
year
was
he
billion
has
company
as
an
u
would
cts
not
which
bank
but
are
this
have
inc
new
were
net
corp
last
one
had
market
or
stock
also
they
about
loss
shares
two
up
share
been
trade
co
shr
government
may
more
oil
sales
first
april
after
debt
exchange
than
over
march
other
we
profit
three
per
their
price
prices
group
banks
interest
no
told
some
if
foreign
dlr
international
week
rate
ltd
japan
agreement
under
could
quarter
tonnes
securities
today
five
tax
there
president
all
expected
against
dollar
february
month
revs
due
total
years
january
common
offer
added
into
financial
economic
world
production
board
because
rates
trading
rose
japanese
end
increase
between
meeting
current
officials
when
made
spokesman
capital
six
earlier
four
industry
now
record
issue
while
system
major
through
months
time
any
business
his
companies
american
sources
investment
only
federal
next
note
official
growth
chairman
finance
markets
countries
should
general
commission
yen
credit
rise
nine
national
out
statement
state
since
who
united
minister
unit
cash
west
before
analysts
stg
exports
department
term
states
pay
report
i
down
agreed
earnings
loan
june
plan
products
period
further
yesterday
central
budget
fell
sale
long
operations
set
can
money
cut
such
program
based
december
compared
public
export
lower
ec
day
currency
most
each
high
reported
offering
take
higher
announced
management
domestic
loans
during
plans
deficit
development
non
bond
around
buy
did
contract
talks
ago
both
shareholders
union
house
t
same
however
york
annual
policy
subsidiary
seven
economy
make
european
committee
so
being
lead
canada
assets
ministry
p
including
dealers
part
oper
country
terms
reagan
owned
demand
ended
outstanding
gas
brazil
proposed
futures
avg
firm
imports
investors
treasury
shrs
still
prior
recent
used
commercial
early
sold
reuters
bonds
income
sell
wheat
well
off
canadian
includes
service
increased
second
south
likely
value
july
our
basis
these
banking
eight
continue
average
level
private
operating
fiscal
available
third
acquisition
days
dividend
expects
fall
industrial
held
half
until
marks
funds
payments
traders
do
chief
services
previously
support
another
agriculture
fund
systems
senior
much
k
full
use
news
mths
those
figures
executive
called
gain
date
notes
firms
surplus
reserves
cost
estimated
amount
purchase
them
short
very
manager
agency
london
help
already
plant
what
previous
close
say
stocks
china
many
supply
results
approved
association
september
open
action
court
energy
industries
gold
bill
stake
preferred
administration
here
reserve
several
move
selling
costs
tender
british
farm
result
francs
include
issued
noted
asked
must
proposal
future
monetary
plc
bid
secretary
output
following
point
sector
payment
low
decision
sugar
possible
nil
div
merger
declined
less
levels
washington
line
reduce
bankers
conference
strong
german
approval
received
decline
largest
deal
prime
issues
financing
convertible
number
soviet
computer
offered
baker
change
losses
members
nations
joint
power
profits
within
might
germany
b
crude
debentures
m
currently
back
additional
later
index
product
inflation
late
large
effective
savings
according
far
points
n
units
way
tokyo
vice
completed
signed
work
local
control
revenues
community
grain
own
provide
gulf
paper
filed
below
whether
producers
insurance
equity
coffee
texas
making
data
western
weeks
qtr
start
although
priced
worth
trust
bought
problems
petroleum
order
comment
forecast
put
congress
reporters
standard
workers
meet
past
opec
position
paid
corn
planned
french
acquire
account
october
drop
spending
least
goods
options
measures
member
office
paris
certain
give
reached
range
friday
does
cents
without
f
negotiations
division
raised
acquired
analyst
even
need
plus
good
de
special
accord
l
equipment
final
subordinated
contracts
led
north
above
subject
people
just
among
real
despite
qtly
marketing
coupon
balance
see
think
fed
proceeds
saying
details
director
remain
officer
closed
fourth
show
party
continued
option
conditions
crop
raise
buying
given
europe
corporate
reduced
holding
then
venture
pacific
initial
area
near
recently
how
consumer
iran
effect
britain
split
scheduled
rights
resources
food
pressure
technology
import
base
ministers
go
america
facility
orders
target
package
bpd
senate
expect
small
holdings
c
france
bills
gains
where
too
research
changes
air
intervention
farmers
mark
security
come
november
council
volume
adjusted
few
little
lending
present
taken
main
working
yield
economists
addition
information
name
series
barrels
free
right
going
allow
proposals
get
showed
transaction
d
home
daily
tomorrow
swiss
receive
become
press
august
political
hold
morning
bundesbank
pact
latest
quoted
areas
manufacturing
commodity
re
yet
force
monday
payable
former
adding
letter
return
revised
law
soon
revenue
fixed
life
began
strike
named
poor
barrel
taiwan
electric
takeover
project
usda
moody
like
existing
steel
needed
leading
james
city
deposits
texaco
case
review
key
white
seeking
tonne
probably
begin
telephone
unchanged
head
rising
capacity
decided
taking
impact
chicago
gave
east
australian
warrants
traded
situation
cuts
partners
tariffs
directors
included
natural
creditors
reduction
agricultural
construction
us
restructuring
response
better
limited
problem
policies
car
holders
place
turnover
sterling
commerce
repurchase
heavy
increases
reform
cars
agreements
currencies
ag
underwriting
top
class
immediately
drug
extraordinary
ending
sharp
morgan
australia
related
want
charge
believe
issuing
combined
don
you
able
overseas
par
saudi
mainly
stores
study
exploration
operation
aid
chemical
slightly
seek
potential
call
growing
soybean
purchases
england
ahead
similar
principal
significant
dollars
discount
dutch
filing
form
sec
involved
southern
mexico
distribution
motors
hit
e
shareholder
rules
figure
brothers
kong
legislation
times
john
ruling
quota
reports
continuing
again
act
customers
boost
rather
almost
she
chrysler
certificates
merrill
institutions
efforts
won
excludes
personal
imf
performance
mortgage
mid
land
seen
developing
listed
delivery
respectively
investor
cocoa
africa
light
nakasone
brokers
taxes
increasing
difficult
cover
concern
war
network
consider
investments
lynch
sharply
corporation
overall
airlines
settlement
enough
communications
partnership
announcement
gross
liquidity
produce
produced
brazilian
producer
hong
discontinued
quotas
j
expansion
raising
lines
disclosed
caused
mining
transactions
remaining
pre
deposit
parent
employees
businesses
took
g
process
crisis
paying
institute
volcker
shearson
mine
franc
credits
improved
greater
robert
risk
vote
interests
keep
introduced
session
estimates
opposition
retail
night
nearly
request
extended
closing
limit
important
italy
statistics
northern
medium
projects
shipments
required
majority
korea
substantial
television
regulatory
post
interview
beginning
longer
aimed
stability
season
motor
iranian
necessary
test
nation
